# AlternateUnitsSuffix Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AlternateUnitsSuffix Property
ParameterTypeId Class See Also
---
"Alternate Units Suffix"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AlternateUnitsSuffix { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AlternateUnitsSuffix As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AlternateUnitsSuffix {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace